test/artillery/users/users-find.yaml
config:
  target: "http://localhost:5000"
  processor: "../helpers/users-payload.js"
  phases:    
    - duration: 60
      arrivalRate: 2
      rampTo: 5
scenarios:
  - name: "Users Find"
    flow:
      - function: "generateRandomPaginationAndData"
      - get:
          url: "/api/users/find?fullName={{fullName}}&userName={{userName}}&pageSize={{pageSize}}&startPage={{startPage}}"