test/artillery/users/users-list.yaml
config:
  target: "http://localhost:5000"
  processor: "../helpers/users-payload.js"
  phases:    
    - duration: 60
      arrivalRate: 2
      rampTo: 5
scenarios:
  - name: "Users List"
    flow:
      - function: "generateRandomPagination"
      - get:
          url: "/api/users/list?pageSize={{pageSize}}&startPage={{startPage}}"